<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
    "http://www.w3.org/TR/1999/REC-html401-19991224/loose.dtd">

<html>
  <head>
    <title>§¥§à§á§à§Ý§ß§Ú§ä§Ö§Ý§î§ß§í§Ö §á§â§à§Ô§â§Ñ§Þ§Þ§í §Õ§Ý§ñ §â§Ñ§Ò§à§ä§í §ã FB2</title>
    <link rel="stylesheet" type="text/css" href="=.css">
  </head>
  <body>
    <div class="topmenu">
      <div class="logo"><img class="noborder" src="logo.png"></div>
      <!--<div class="mirror">
	<a class="menu small" href="http://haali.rt.ru/pocketpc/">§©§Ö§â§Ü§Ñ§Ý§à 1</a><br>
	<a class="menu small" href="http://haali.cs.msu.ru/pocketpc/">§©§Ö§â§Ü§Ñ§Ý§à 2</a>
      </div>-->
      <a class="menu sep" href="index.html.ru">§¤§Ý§Ñ§Ó§ß§Ñ§ñ</a>
      <a class="menu sep" href="news.html.ru">§¯§à§Ó§à§ã§ä§Ú</a>
      <a class="menu sep" href="download.html.ru">§³§Ü§Ñ§é§Ñ§ä§î</a>
      <a class="menu sep" href="screenshots.html.ru">§¬§Ñ§â§ä§Ú§ß§Ü§Ú</a>
      <a class="menu sep" href="docs.html.ru">§¥§à§Ü§å§Þ§Ö§ß§ä§Ñ§è§Ú§ñ</a>
      <a class="menu sep" href="bugs.html.ru">§°§ê§Ú§Ò§Ü§Ú</a>
      <a class="menu sep" href="scripts.html.ru">FB Tools</a>
      <a class="menu sep" href="fb2.html.ru">FB2.0</a>
      <a class="menu" href="index.html.en">English page</a>
    </div>
    <div class="main">

<!-- vim: set syn=html : -->


   <h3>§¥§à§á§à§Ý§ß§Ú§ä§Ö§Ý§î§ß§í§Ö §á§â§à§Ô§â§Ñ§Þ§Þ§í §Õ§Ý§ñ §â§Ñ§Ò§à§ä§í §ã FB2</h3>
   <h4>FictionBook Tools</h4>
   <div class="center">
   <img src="img/explorer_xp.png"><br>
   §±§â§à§Ó§à§Õ§ß§Ú§Ü §Ó WinXP §ã §å§ã§ä§Ñ§ß§à§Ó§Ý§Ö§ß§ß§í§Þ§Ú FB Tools
   </div>
   <br>
   FB Tools - §á§Ñ§Ü§Ö§ä §á§â§à§Ô§â§Ñ§Þ§Þ §Õ§Ý§ñ §à§Ò§Ý§Ö§Ô§é§Ö§ß§Ú§ñ §â§Ñ§Ò§à§ä§í §ã §Ü§ß§Ú§Ô§Ñ§Þ§Ú §Ó Windows. §£ §ß§Ö§Ô§à §Ó§ç§à§Õ§ñ§ä
   §ã§Ý§Ö§Õ§å§ð§ë§Ú§Ö §Ü§à§Þ§á§à§ß§Ö§ß§ä§í:
   <ul>
    <li>§£§Ñ§Ý§Ú§Õ§Ñ§ä§à§â FB2 §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó</li>
    <li>§²§Ö§Õ§Ñ§Ü§ä§à§â FB2 §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó</li>
    <li>§±§â§à§Ó§Ñ§Û§Õ§Ö§â §Ú§ß§æ§à§â§Þ§Ñ§è§Ú§Ú §à§Ò FB2 §Õ§à§Ü§å§Þ§Ö§ß§ä§Ñ§ç §Ó §±§â§à§Ó§à§Õ§ß§Ú§Ü§Ö (§á§à§Ù§Ó§à§Ý§ñ§Ö§ä §á§â§à§ã§Þ§Ñ§ä§â§Ú§Ó§Ñ§ä§î
        §Ñ§Ó§ä§à§â§à§Ó, §ß§Ñ§Ù§Ó§Ñ§ß§Ú§Ö, §Ø§Ñ§ß§â §Ú §á§â§à§é§å§ð §Ú§ß§æ§à§â§Þ§Ñ§è§Ú§ð §á§â§ñ§Þ§à §Ó §á§â§à§Ó§à§Õ§ß§Ú§Ü§Ö, §ß§Ö §à§ä§Ü§â§í§Ó§Ñ§ñ §æ§Ñ§Û§Ý).</li>
   </ul>
   §£§ã§Ö §á§â§Ú§Ý§à§Ø§Ö§ß§Ú§ñ §Ú§ß§ä§Ö§Ô§â§Ú§â§å§ð§ä§ã§ñ §ã §á§â§à§Ó§à§Õ§ß§Ú§Ü§à§Þ §Ú §Õ§à§Ò§Ñ§Ó§Ý§ñ§ð§ä §Ü§à§Þ§Ñ§ß§Õ§í §Ó §Ü§à§ß§ä§Ö§Ü§ã§ä§ß§à§Ö §Þ§Ö§ß§ð
   §Õ§Ý§ñ §á§Ñ§á§à§Ü (Validate FictionBook Documents) §Ú §æ§Ñ§Û§Ý§à§Ó §ã §â§Ñ§ã§ê§Ú§â§Ö§ß§Ú§Ö§Þ .fb2 (Edit,Validate).
   §²§Ö§Õ§Ñ§Ü§ä§à§â §å§Þ§Ö§Ö§ä §Ú§Ù§Þ§Ö§ß§ñ§ä§î §á§à§Ý§ñ §à§á§Ú§ã§Ñ§ß§Ú§ñ §Õ§à§Ü§å§Þ§Ö§ß§ä§Ñ, §ï§Ü§ã§á§à§â§ä§Ú§â§à§Ó§Ñ§ä§î §æ§Ñ§Û§Ý§í HTML, §Ó§í§Ù§í§Ó§Ñ§ä§î
   <a href="http://www.gribuser.ru/freeware/cleartxt/index.shtml">Any2FB2</a> §Õ§Ý§ñ §Ú§Þ§á§à§â§ä§Ñ
   §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó §Ó §Õ§â§å§Ô§Ú§ç §æ§à§â§Þ§Ñ§ä§Ñ§ç. <strong>§£§ß§Ú§Þ§Ñ§ß§Ú§Ö!</strong> §²§Ö§Õ§Ñ§Ü§ä§à§â §Ú§Ô§ß§à§â§Ú§â§å§Ö§ä §Ó§ã§Ö XML
   §Ü§à§Þ§Þ§Ö§ß§ä§Ñ§â§Ú§Ú §Ú
   §ß§Ö§Ú§Ù§Ó§Ö§ã§ä§ß§í§Ö §ï§Ý§Ö§Þ§Ö§ß§ä§í §á§â§Ú §é§ä§Ö§ß§Ú§Ú §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó, §ä§Ñ§Ü §é§ä§à §Ò§å§Õ§î§ä§Ö §à§ã§ä§à§â§à§Ø§ß§í, §á§â§Ú §é§ä§Ö§ß§Ú§Ú §æ§Ñ§Û§Ý§à§Ó
   §ã §Ü§à§Þ§Þ§Ö§ß§ä§Ñ§â§Ú§ñ§Þ§Ú §Ú §á§à§ã§Ý§Ö§Õ§å§ð§ë§Ö§Û §Ù§Ñ§á§Ú§ã§Ú, §Ó§ã§Ö §Ü§à§Þ§Þ§Ö§ß§ä§Ñ§â§Ú§Ú §á§â§à§á§Ñ§Õ§å§ä.
   <br><br>
   <strong>FB Tools §â§Ñ§Ò§à§ä§Ñ§ð§ä <em>§ä§à§Ý§î§Ü§à §á§à§Õ Windows NT4/2K/XP</em></strong>.
   §¥§Ý§ñ §â§Ñ§Ò§à§ä§í FBTools §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ <a href="http://www.microsoft.com/downloads/details.aspx?familyid=3144b72b-b4f2-46da-b4b6-c5d7485f2b42&displaylang=en">MSXML4</a>.<br>
   §³§Ü§Ñ§é§Ñ§ä§î: <a href="files/FictionBook Tools v2.0 Setup.exe">FictionBook Tools v2.0 Setup.exe</a>
   ( 523k), <a href="files/FBE_Rel.tgz">§ª§ã§ç§à§Õ§ß§Ú§Ü§Ú</a> ( 345k).
   <br><hr noshade="1">
   <h4>§³§Ü§â§Ú§á§ä§í</h4>
   <ul>
  <li>§±§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§Ö §Ú§Ù §á§â§à§ã§ä§à§Ô§à §ä§Ö§Ü§ã§ä§Ñ §Ó XML: §â§Ñ§ã§ã§é§Ú§ä§Ñ§ß§à
  §ß§Ñ §Ü§ß§Ú§Ô§Ú §Ú§Ù <a href="http://lib.ru/">§Ò§Ú§Ò§Ý§Ú§à§ä§Ö§Ü§Ú §®§Ñ§Ü§ã§Ú§Þ§Ñ §®§à§ê§Ü§à§Ó§Ñ</a>, §ß§à§â§Þ§Ñ§Ý§î§ß§à §á§à§ß§Ú§Þ§Ñ§Ö§ä
  HTML §Ó§Ñ§â§Ú§Ñ§ß§ä §Ü§ß§Ú§Ô. §¯§Ñ §Ò§à§Ý§Ö§Ö §ã§Ý§à§Ø§ß§à§Þ HTML §ã§Ü§à§â§Ö§Ö §Ó§ã§Ö§Ô§à §Ò§å§Õ§Ö§ä §Ô§Ý§ð§é§Ú§ä§î. §¥§Ý§ñ §Ù§Ñ§á§å§ã§Ü§Ñ §ß§å§Ø§Ö§ß
  Perl §á§à§Õ Windows §Ú §Þ§à§Õ§å§Ý§î Win32::GUI.<br>
  <a href="files/wtxt2xml.pl">wtxt2xml.pl</a> - §ã Win32 GUI,
  <a href="files/txt2xml.pl">txt2xml.pl</a> - §Ù§Ñ§á§å§ã§Ü §Ú§Ù §Ü§à§Þ§Ñ§ß§Õ§ß§à§Û §ã§ä§â§à§Ü§Ú, §â§Ñ§Ò§à§ä§Ñ§Ö§ä §Ó§Ö§Ù§Õ§Ö,
  <a href="files/T2X.pm">T2X.pm</a> - §à§Ò§ë§Ú§Û §Þ§à§Õ§å§Ý§î §á§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§ñ.
  </li>
  <li>
  §±§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§Ö §Ú§Ù HTML §Ó XML, §ç§à§â§à§ê§à §â§Ñ§Ù§Ò§Ú§â§Ñ§Ö§ä HTML,
  §Ü§à§ä§à§â§í§Û §á§Ú§ê§Ö§ä M$ Office: <a href="files/html2xml.pl">html2xml.pl</a><br>
  <ul>
   <li>05/04/02 §ª§Ù§Ó§Ý§Ö§Ü§Ñ§Ö§ä §ß§Ö§Ü§à§ä§à§â§í§Ö §ã§Ó§à§Û§ã§ä§Ó§Ñ §Õ§à§Ü§å§Þ§Ö§ß§ä§Ñ §Ú§Ù §Ù§Ñ§Ô§à§Ý§à§Ó§Ü§Ñ, §Õ§Ý§ñ §ï§ä§à§Ô§à §ß§å§Ø§Ö§ß Win32::OLE §Ú MSXML4</li>
   <li>19/02/02 §¥§à§Ò§Ñ§Ó§Ú§Ý §â§Ñ§ã§á§à§Ù§ß§Ñ§Ó§Ñ§ß§Ú§Ö §ã§ß§à§ã§à§Ü §Ú §á§à§é§Ú§ß§Ú§Ý §Ü§Ñ§Ü§Ú§Ö-§ä§à §Þ§Ö§Ý§à§é§Ú.</li>
  </ul>
  </li>
  <li>XSL<br>
   <ul>
  <li>XSL §Õ§Ý§ñ §á§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§ñ §Ú§Ù FB1 §Ó FB2: <a href="files/fb1tofb2.xsl">fb1tofb2.xsl</a>.</li>
  <li>XSL §Õ§Ý§ñ §á§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§ñ §Ú§Ù lite §Ó FB1: <a href="files/lite2fb.xsl">lite2fb.xsl</a>.</li>
  </ul>
   §¥§Ý§ñ §á§â§Ú§Þ§Ö§ß§Ö§ß§Ú§ñ §ï§ä§Ú§ç XSL §Þ§à§Ø§ß§à §Ó§à§ã§á§à§Ý§î§Ù§à§Ó§Ñ§ä§î§ã§ñ <a href="http://msdn.microsoft.com/XML/XMLDownloads/default.aspx">msxsl</a>. §´§Ñ§Ü§Ø§Ö
   §Þ§à§Ø§ß§à §á§à§é§Ú§ä§Ñ§ä§î <a href="HowToFB2.htm">§Ú§ß§ã§ä§â§å§Ü§è§Ú§ð</a> §¥§Þ§Ú§ä§â§Ú§ñ §±§Ö§ä§â§à§Ó§Ñ §á§à §å§ã§ä§Ñ§ß§à§Ó§Ü§Ö §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§í§ç
   §á§â§à§Ô§â§Ñ§Þ§Þ §á§à§Õ Windows. <strong>§±§à§Ø§Ñ§Ý§å§Û§ã§ä§Ñ, §à§Ò§â§Ñ§ä§Ú§ä§Ö §Ó§ß§Ú§Þ§Ñ§ß§Ú§Ö §ß§Ñ §ä§à, §é§ä§à §ï§ä§Ú XSL §ß§Ö §Ô§Ñ§â§Ñ§ß§ä§Ú§â§å§ð§ä
   §á§à§Ý§å§é§Ö§ß§Ú§Ö §Ò§Ö§Ù§à§ê§Ú§Ò§é§ß§à§Ô§à FB2 §Õ§à§Ü§å§Þ§Ö§ß§ä§Ñ. §°§Ò§ñ§Ù§Ñ§ä§Ö§Ý§î§ß§à §á§â§à§Ó§Ö§â§ñ§Û§ä§Ö §â§Ö§Ù§å§Ý§î§ä§Ñ§ä§í §Ó§Ñ§Ý§Ú§Õ§Ñ§ä§à§â§à§Þ.</strong>
  </li>
  <li>§³§Ü§â§Ú§á§ä §Õ§Ý§ñ §á§â§à§Ó§Ö§â§Ü§Ú §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó §ß§Ñ §ã§à§à§ä§Ó§Ö§ä§ã§ä§Ó§Ú§Ö §ã§ä§Ñ§ß§Õ§Ñ§â§ä§å FB2.0:
      <a href="files/xmlwf.vbs">xmlwf.vbs</a>. §³§á§à§ã§à§Ò §á§â§Ú§Þ§Ö§ß§Ö§ß§Ú§ñ: §Ú§Ù §Ü§à§Þ§Ñ§ß§Õ§ß§à§Û §ã§ä§â§à§Ü§Ú §ß§Ñ§Ò§Ö§â§Ú§ä§Ö
      <code>cscript //nologo &lt;§á§å§ä§î §Ü xmlwf.vbs&gt; &lt;§á§å§ä§î §Ü FictionBook.xsd&gt; &lt;§á§â§à§Ó§Ö§â§ñ§Ö§Þ§í§Û §Õ§à§Ü§å§Þ§Ö§ß§ä&gt;</code>. §¥§Ý§ñ §Ù§Ñ§á§å§ã§Ü§Ñ §ß§Ö§Ò§ç§à§Õ§Ú§Þ MSXML4 §Ú Windows Scripting Host.</li>
      </ul>
  <br><hr noshade="1">
<h4>§®§Ñ§Ü§â§à§ã §Õ§Ý§ñ §ï§Ü§ã§á§à§â§ä§Ñ §Õ§à§Ü§å§Þ§Ö§ß§ä§à§Ó Word §Ó XML</h4>
§¹§ä§à §å§Þ§Ö§Ö§ä:<br>
<ul>
<li> §Ó§í§Õ§Ö§Ý§Ö§ß§Ú§Ö §Ô§Ý§Ñ§Ó §Ó §ã§à§à§ä§Ó§Ö§ä§ã§ä§Ó§Ú§Ú §ã§à §ã§ä§â§å§Ü§ä§å§â§à§Û §Õ§à§Ü§å§Þ§Ö§ß§ä§Ñ</li>
<li> §á§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§Ú§Ö §Ø§Ú§â§ß§à§Ô§à §Ú §Ü§å§â§ã§Ú§Ó§Ñ §Ó strong §Ú emphasis</li>
<li> §â§Ñ§ã§á§à§Ù§ß§Ñ§Ö§ä §ã§ä§Ú§Ý§Ú "Epigraph" §Ú "Epigraph Author" §á§à§ã§Ý§Ö §Ù§Ñ§Ô§à§Ý§à§Ó§Ü§Ñ §Ô§Ý§Ñ§Ó§í §Ú §Ó §ã§Ñ§Þ§à§Þ §ß§Ñ§é§Ñ§Ý§Ö §æ§Ñ§Û§Ý§Ñ</li>
<li> §â§Ñ§ã§á§à§Ù§ß§Ñ§Ö§ä §ã§ä§Ú§Ý§î "Annotation" §Ñ§ß§Ñ§Ý§à§Ô§Ú§é§ß§à §ï§á§Ú§Ô§â§Ñ§æ§Ñ§Þ, §Ö§ã§Ý§Ú §Ú§ã§á§à§Ý§î§Ù§å§Ö§ä§ã§ñ §Ú §ä§à §Ú §Õ§â§å§Ô§à§Ö, §ä§à "Annotaion" §Õ§à§Ý§Ø§Ö§ß §Ú§Õ§ä§Ú §á§à§ã§Ý§Ö §Ó§ã§Ö§ç §ï§á§Ú§Ô§â§Ñ§æ§à§Ó</li>
<li> §â§Ñ§ã§á§à§Ù§ß§Ñ§Ö§ä §ã§ä§Ú§Ý§Ú "Cite" §Ú "Cite Author" §Ó §Ý§ð§Ò§à§Þ §Þ§Ö§ã§ä§Ö §Ô§Ý§Ñ§Ó§í.</li>
<li> §â§Ñ§ã§á§à§Ù§ß§Ñ§Ö§ä §ã§ä§Ú§ç§Ú, §ß§Ñ§Ù§Ó§Ñ§ß§Ú§Ö §ã§ä§Ú§ç§à§ä§Ó§à§â§Ö§ß§Ú§ñ §Õ§à§Ý§Ø§ß§à §Ò§í§ä§î §Ó§í§Õ§Ö§Ý§Ö§ß§à §ã§ä§Ú§Ý§Ö§Þ "Poem Title", §á§à§ã§Ý§Ö §ß§Ö§Ô§à §Õ§à§Ý§Ø§ß§í §Ú§Õ§ä§Ú §Ñ§Ò§Ù§Ñ§è§í §ã§ä§Ú§Ý§Ö§Þ "Stanza", §Ü§à§ä§à§â§í§Ö §á§â§Ö§Ó§â§Ñ§ë§Ñ§ð§ä§ã§ñ §Ó &lt;stanza&gt;&lt;v&gt;&lt;/stanza&gt;, §á§å§ã§ä§í§Ö §ã§ä§â§à§Ü§Ú §â§Ñ§Ù§Õ§Ö§Ý§ñ§ð§ä &lt;stanza&gt;</li>
<li> §á§â§Ö§Ó§â§Ñ§ë§Ñ§Ö§ä §ã§ß§à§ã§Ü§Ú (Footnotes,Endnotes) §Ó &lt;a type="note"&gt;</li>
</ul>
§¬§Ñ§Ü §á§à§Ý§î§Ù§à§Ó§Ñ§ä§î§ã§ñ:<br>
<br>
§µ§ã§ä§Ñ§ß§à§Ó§Ú§ä§î MSXML3 (§Ó§ç§à§Õ§Ú§ä §Ó IE6, §Ú§Ý§Ú §Õ§à§ã§ä§å§á§Ö§ß §Õ§Ý§ñ §ã§Ü§Ñ§é§Ú§Ó§Ñ§ß§Ú§ñ §à§ä§Õ§Ö§Ý§î§ß§à §ß§Ñ microsoft.com)<br>
§³§Ü§Ñ§é§Ñ§ä§î §Ô§à§ä§à§Ó§í§Û <a href="files/ExportXML.dot">ExportXML.dot</a>.<br>
<br>
§´§Ö§á§Ö§â§î §Þ§à§Ø§ß§à §à§ä§Ü§â§í§ä§î §Ü§Ñ§Ü§à§Û-§ß§Ú§Ò§å§Õ§î §Õ§à§Ü§å§Þ§Ö§ß§ä, §Ù§Ñ§Û§ä§Ú §Ó Tools-&gt;(§º§Ñ§Ò§Ý§à§ß§í §Ú §ã§ä§Ú§Ý§Ú),
§á§â§Ú§Þ§Ö§ß§Ú§ä§î §ï§ä§à§ä §ê§Ñ§Ò§Ý§à§ß, §â§Ñ§ã§ã§ä§Ñ§Ó§Ú§ä§î §ã§ä§Ú§Ý§Ú §á§à §Ó§Ü§å§ã§å §Ú §á§à§á§â§à§Ò§à§Ó§Ñ§ä§î §Ó§à§ã§á§à§Ý§î§Ù§à§Ó§Ñ§ä§î§ã§ñ §á§å§ß§Ü§ä§à§Þ §Þ§Ö§ß§ð
Export as FictionBook XML...<br>
§²§Ö§Õ§Ñ§Ü§ä§Ú§â§à§Ó§Ñ§ß§Ú§Ö §à§ä§Õ§Ö§Ý§î§ß§í§ç §ã§ä§â§à§Ü §Ó §Õ§Ú§Ñ§Ý§à§Ô§Ö §ã§Ó§à§Û§ã§ä§Ó FB §à§ã§å§ë§Ö§ã§ä§Ó§Ý§ñ§Ö§ä§ã§ñ §Ü§ß§à§á§Ü§à§Û F2.<br>
<br>



      <hr noshade="1">
      <div class="update">§±§à§ã§Ý§Ö§Õ§ß§Ö§Ö §à§Ò§ß§à§Ó§Ý§Ö§ß§Ú§Ö: 2005/01/30 15:46</div>
      §¡§Ó§ä§à§â: <a href="mailto:mike@haali.net">§®§Ú§ç§Ñ§Ú§Ý §®§Ñ§è§ß§Ö§Ó, mike@haali.net</a>
    </div>
  </body>
</html>