<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ru" lang="ru">
 <head>
  <title>
   Haali Reader - §á§â§à§Ô§â§Ñ§Þ§Þ§Ñ §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ §Ü§ß§Ú§Ô §á§à§Õ Windows CE
  </title>
  <link rel="stylesheet" type="text/css" href="=.css">
 </head>
 <body>
  <div class="topmenu">
 <a class="menu sep" href="index.html.ru">§¤§Ý§Ñ§Ó§ß§Ñ§ñ</a>
 <a class="menu sep" href="news.html.ru">§¯§à§Ó§à§ã§ä§Ú</a>
 <a class="menu sep" href="download.html.ru">§³§Ü§Ñ§é§Ñ§ä§î</a>
 <a class="menu sep" href="scripts.html.ru">§³§Ü§â§Ú§á§ä§í</a>
 <a class="menu" href="index.html.en">English page</a>
<!-- <br>
 <a class="menu small sep" href="http://haali.cs.msu.ru/pocketpc/">§©§Ö§â§Ü§Ñ§Ý§à 1</a>
 <a class="menu small" href="http://haali.rt.ru/pocketpc/">§©§Ö§â§Ü§Ñ§Ý§à 2</a></p> -->
</div>
<!-- vim: set syn=html : -->

  <h3>§¿§Ý§Ö§Ü§ä§â§à§ß§ß§í§Ö §Ü§ß§Ú§Ô§Ú §ß§Ñ §Ü§Ñ§â§Þ§Ñ§ß§ß§à§Þ §Ü§à§Þ§á§î§ð§ä§Ö§â§Ö (PocketPC)</h3>
  <p>§£ §â§Ö§Ù§å§Ý§î§ä§Ñ§ä§Ö §Ú§ã§ã§Ý§Ö§Õ§à§Ó§Ñ§ß§Ú§ñ §Ú§Þ§Ö§ð§ë§Ú§ç§ã§ñ §á§â§à§Ô§â§Ñ§Þ§Þ §Õ§Ý§ñ §á§â§à§ã§Þ§à§ä§â§Ñ §ä§Ö§Ü§ã§ä§à§Ó,
  §Ó§í§ñ§ã§ß§Ú§Ý§à§ã§î, §é§ä§à §å §Ó§ã§Ö§ç §Ú§Ù §ß§Ú§ç §Ö§ã§ä§î §ã§Ö§â§î§Ö§Ù§ß§í§Ö §ß§Ö§Õ§à§ã§ä§Ñ§ä§Ü§Ú, §ß§Ñ§á§â§Ú§Þ§Ö§â,
  §ã§Ý§Ú§ê§Ü§à§Þ §Ò§à§Ý§î§ê§Ú§Ö §á§à§Ý§ñ, §à§ä§ã§å§ä§ã§ä§Ó§Ú§Ö §á§à§Õ§Õ§Ö§â§Ø§Ü§Ú §â§å§ã§ã§Ü§Ú§ç §Ü§à§Õ§Ú§â§à§Ó§à§Ü,
  §ß§Ö§å§Õ§à§Ò§ß§í§Ö §ß§Ñ§ã§ä§â§à§Û§Ü§Ú §ê§â§Ú§æ§ä§Ñ. §±§â§Ú§ê§Ý§à§ã§î §á§Ú§ã§Ñ§ä§î §ä§Ñ§Ü§å§ð §á§â§à§Ô§â§Ñ§Þ§Þ§Ü§å §ã§Ñ§Þ§à§Þ§å.</p>
  <h4>§°§Ò§à §Ó§ã§Ö§Þ</h4>
  <p>§Á §ã§Ö§â§î§Ö§Ù§ß§à §Ù§Ñ§ß§ñ§Ý§ã§ñ §á§à§Õ§Õ§Ö§â§Ø§Ü§à§Û FB2.0 §Ó §é§Ú§ä§Ñ§Ý§Ü§Ö §Ú §Õ§å§Þ§Ñ§ð, §ä§â§à§Ô§Ñ§ä§î Haali Reader 1.0 §Ò§à§Ý§î§ê§Ö §ß§Ö
     §Ò§å§Õ§å. §³§Ý§Ö§Õ§å§ð§ë§Ñ§ñ §Ó§Ö§â§ã§Ú§ñ HR §Ò§å§Õ§Ö§ä 2.0, §ã §á§à§Õ§Õ§Ö§â§Ø§Ü§à§Û §ä§à§Ý§î§Ü§à FB2.0, FB1.x §Ú XMLLite §à§ß§Ñ §á§à§ß§Ú§Þ§Ñ§ä§î
     §ß§Ö §Ò§å§Õ§Ö§ä. §£ HR 2.0 §à§Ø§Ú§Õ§Ñ§Ö§ä§ã§ñ §Þ§ß§à§Ô§à §Ó§Ü§å§ã§ß§à§ã§ä§Ö§Û, §à§ã§ß§à§Ó§ß§í§Ö §Ú§Ù§Þ§Ö§ß§Ö§ß§Ú§ñ/§Õ§à§Ò§Ñ§Ó§Ý§Ö§ß§Ú§ñ: §å§ã§Ü§à§â§Ö§ß§Ú§Ö
     §Ù§Ñ§Ô§â§å§Ù§Ü§Ú XML §æ§Ñ§Û§Ý§à§Ó §Ó 2-3 §â§Ñ§Ù§Ñ, §á§à§Õ§Õ§Ö§â§Ø§Ü§Ñ §ã§ä§Ú§Ý§Ö§Û (§ß§Ñ§Ü§à§ß§Ö§è §ä§à §Þ§à§Ø§ß§à §Ò§å§Õ§Ö§ä §ã§à§Õ§Ö§â§Ø§Ñ§ä§Ö§Ý§î§ß§à
     §Ú§ã§á§à§Ý§î§Ù§à§Ó§Ñ§ä§î §Õ§Ñ§Ó§ß§à §Ù§Ñ§â§Ö§Ù§Ö§â§Ó§Ú§â§à§Ó§Ñ§ß§ß§í§Û §ï§Ý§Ö§Þ§Ö§ß§ä &lt;style&gt;), §å§Ý§å§é§ê§Ö§ß§ß§Ñ§ñ §á§à§Õ§Õ§Ö§â§Ø§Ü§Ñ unicode
     §á§à§Ù§Ó§à§Ý§ñ§Ö§ä §ã§à§Ò§â§Ñ§ä§î §á§â§à§Ô§â§Ñ§Þ§Þ§å §Õ§Ý§ñ §â§Ñ§Ò§à§ä§í §Õ§Ñ§Ø§Ö §á§à§Õ win9x, §ß§å §Ú, §Ü§Ñ§Ü §Ó§ã§Ö§Ô§Õ§Ñ, §Ü§å§é§Ñ §Þ§Ö§Ý§Ü§Ú§ç
     §Ú§ã§á§â§Ñ§Ó§Ý§Ö§ß§Ú§Û §Ú §å§Ý§å§é§ê§Ö§ß§Ú§Û.<br>
     §¯§à§Ó§Ñ§ñ §Ó§Ö§â§ã§Ú§ñ §à§Ü§à§ß§é§Ñ§ä§Ö§Ý§î§ß§à §á§à§ñ§Ó§Ú§ä§ã§ñ §Ó§Þ§Ö§ã§ä§Ö §æ§Ú§ß§Ñ§Ý§î§ß§í§Þ §Ó§Ñ§â§Ú§Ñ§ß§ä§à§Þ FB2.0, §Ñ §á§à§Ü§Ñ §á§Ö§â§Õ§Ó§Ñ§â§Ú§ä§Ö§Ý§î§ß§å§ð
     §Ó§Ö§â§ã§Ú§ð §Þ§à§Ø§ß§à §á§à§ã§Þ§à§ä§â§Ö§ä§î §ß§Ñ <a href="/pocketpc/fb2.html.ru">§ã§ä§â§Ñ§ß§Ú§é§Ü§Ö FB2.0</a></p>
  <p>§¹§Ñ§ã§ä§Ö§ß§î§Ü§à §Ø§Ñ§Ý§å§ð§ä§ã§ñ §ß§Ñ §ä§à, §é§ä§à §Ú§ß§Õ§Ú§Ü§Ñ§ä§à§â §á§à§Ý§à§Ø§Ö§ß§Ú§ñ §Ó §ä§Ö§Ü§ã§ä§Ö §ß§Ñ§á§à§Ý§Ù§Ñ§Ö§ä §ß§Ñ §á§à§ã§Ý§Ö§Õ§ß§ð§ð
    §ã§ä§â§à§Ü§å §ä§Ö§Ü§ã§ä§Ñ. §¯§Ñ§á§à§Ý§Ù§Ñ§ß§Ú§Ö §â§Ö§Ô§å§Ý§Ú§â§å§Ö§ä§ã§ñ §ß§Ñ§ã§ä§â§à§Û§Ü§à§Û Options-&gt;Display-&gt;Bottom margin.
    §Á §ã§Õ§Ö§Ý§Ñ§Ý §Ó§í§Ó§à§Õ §ß§Ñ §ï§Ü§â§Ñ§ß §Ú§Þ§Ö§ß§ß§à §ä§Ñ§Ü§Ú§Þ §ã§á§à§ã§à§Ò§à§Þ §Ú§Ù-§Ù§Ñ §ä§à§Ô§à, §é§ä§à §Ú§ß§à§Ô§Õ§Ñ §ß§Ö§ç§Ó§Ñ§ä§Ñ§Ö§ä §à§Õ§ß§à§Ô§à-§Õ§Ó§å§ç
    §á§Ú§Ü§ã§Ö§Ý§Ö§Û §Õ§Ý§ñ §Ó§í§Ó§à§Õ§Ñ §á§à§Ý§ß§à§Û §ã§ä§â§à§Ü§Ú §ä§Ö§Ü§ã§ä§Ñ §Ó §ã§Ñ§Þ§à§Þ §ß§Ú§Ù§å §à§Ü§ß§Ñ, §Ñ §á§Ö§â§Ö§Ü§â§í§ä§Ú§Ö §Ó §à§Õ§ß§å §Ú§Ý§Ú §Õ§Ó§Ö §ä§à§é§Ü§Ú
    §ã§Þ§à§ä§â§Ú§ä§ã§ñ §á§à§é§ä§Ú §ß§Ö§Ù§Ñ§Þ§Ö§ä§ß§à. §£ §á§à§ã§Ý§Ö§Õ§ß§Ú§ç §Ó§Ö§â§ã§Ú§ñ§ç §Ó§í§ã§à§ä§Ñ §Ú§ß§Õ§Ú§Ü§Ñ§ä§à§â§Ñ §á§à§Ý§à§Ø§Ö§ß§Ú§ñ §å§Ó§Ö§Ý§Ú§é§Ú§Ý§Ñ§ã§î §ã 2 §Õ§à 6
    §á§Ú§Ü§ã§Ö§Ý§Ö§Û, §Ñ §á§â§Ú §å§ã§ä§Ñ§ß§à§Ó§Ü§Ö §ß§à§Ó§à§Û §Ó§Ö§â§ã§Ú§Ú §Ó §â§Ö§Ö§ã§ä§â§Ö §à§ã§ä§Ñ§Ö§ä§ã§ñ §ã§ä§Ñ§â§à§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §ß§Ú§Ø§ß§Ö§Ô§à §á§à§Ý§ñ,
    §á§à§ï§ä§à§Þ§å §á§â§Ú §à§Ò§ß§à§Ó§Ý§Ö§ß§Ú§Ú §ä§â§Ö§Ò§å§Ö§ä§ã§ñ §â§å§é§ß§Ñ§ñ §ß§Ñ§ã§ä§â§à§Û§Ü§Ñ §ï§ä§à§Ô§à §á§Ñ§â§Ñ§Þ§Ö§ä§â§Ñ.</p>
  <h4>§°§ã§ß§à§Ó§ß§í§Ö §Ó§à§Ù§Þ§à§Ø§ß§à§ã§ä§Ú:</h4>
  <ul>
   <li>§±§â§à§ã§Þ§à§ä§â §ä§Ö§Ü§ã§ä§à§Ó§í§ç §Ú XML §æ§Ñ§Û§Ý§à§Ó: <a href="http://www.ebookstools.net/xml2lit/xml2lit_r.htm">xml2lit</a>,
       <a href="http://www.gribuser.ru/freeware/cleartxt/index.shtml">ClearTXT</a>, §Ü§ß§Ú§Ô§Ú §Ó
       XML §Þ§à§Ø§ß§à §Ó§Ù§ñ§ä§î §Ó <a href="http://lit.km.ru/">§¢§Ú§Ò§Ý§Ú§à§ä§Ö§Ü§Ö §®§å§ç§à§Þ§à§â§Ñ</a>.</li>
   <li>§±§à§Õ§Õ§Ö§â§Ø§Ü§Ñ §Ü§Ú§â§Ú§Ý§Ý§Ú§è§í c §Ñ§Ó§ä§à§Þ§Ñ§ä§Ú§é§Ö§ã§Ü§Ú§Þ §à§á§â§Ö§Õ§Ö§Ý§Ö§ß§Ú§Ö§Þ §Ü§à§Õ§Ú§â§à§Ó§Ü§Ú
       (§Ó§à§Ù§Þ§à§Ø§Ö§ß §â§å§é§ß§à§Û §Ó§í§Ò§à§â).</li>
   <li>§³§à§ç§â§Ñ§ß§Ö§ß§Ú§Ö §ä§Ö§Ü§å§ë§Ö§Û §á§à§Ù§Ú§è§Ú§Ú §Ó §æ§Ñ§Û§Ý§Ö §á§â§Ú §Ó§í§ç§à§Õ§Ö §Ú§Ù §á§â§à§Ô§â§Ñ§Þ§Þ§í.</li>
   <li>§±§à§Õ§Õ§Ö§Ø§Ü§Ñ ClearType.</li>
   <li>§£§à§Ù§Þ§à§Ø§ß§à§ã§ä§î §Ó§í§Ò§à§â§Ñ §Ý§ð§Ò§à§Ô§à §ê§â§Ú§æ§ä§Ñ/§â§Ñ§Ù§Þ§Ö§â§Ñ.</li>
   <li>§±§à§Ý§ß§à§ï§Ü§â§Ñ§ß§ß§í§Û §â§Ö§Ø§Ú§Þ.</li>
   <li>Landscape §â§Ö§Ø§Ú§Þ.</li>
   <li>§£§í§Ò§à§â §è§Ó§Ö§ä§à§Ó.</li>
   <li>§±§à§Ú§ã§Ü §á§à §ä§Ö§Ü§ã§ä§å.</li>
   <li>§£§ã§ä§â§à§Ö§ß§ß§Ñ§ñ §á§à§Õ§Õ§Ö§â§Ø§Ü§Ñ §ã§Ý§à§Ó§Ñ§â§ñ. §¥§à§ã§ä§Ñ§ä§à§é§ß§à §ä§Ü§ß§å§ä§î §Ó §ã§Ý§à§Ó§à §Õ§Ý§ñ §ä§à§Ô§à
       §é§ä§à§Ò§í §å§Ó§Ú§Õ§Ö§ä§î §á§Ö§â§Ö§Ó§à§Õ.</li>
   <li>§¡§Ó§ä§à§Þ§Ñ§ä§Ú§é§Ö§ã§Ü§Ñ§ñ §â§Ñ§ã§ã§ä§Ñ§ß§à§Ó§Ü§Ñ §á§Ö§â§Ö§ß§à§ã§à§Ó, §Ö§ã§Ý§Ú §Þ§ñ§Ô§Ü§Ú§Ö §á§Ö§â§Ö§ß§à§ã§í §å§Ø§Ö §â§Ñ§ã§ã§ä§Ñ§Ó§Ý§Ö§ß§í §Ó §ä§Ö§Ü§ã§ä§Ö, §ä§à §à§ß§Ú §ä§à§Ø§Ö
       §Ú§ã§á§à§Ý§î§Ù§å§ð§ä§ã§ñ.</li>
   <li>§©§Ñ§Ü§Ý§Ñ§Õ§Ü§Ú §Ú §à§Ô§Ý§Ñ§Ó§Ý§Ö§ß§Ú§Ö.</li>
   <li>§£§í§Ó§à§Õ §ä§Ö§Ü§ã§ä§Ñ §Ó §Õ§Ó§Ö §Ü§à§Ý§à§ß§Ü§Ú.</li>
   <li>§¹§ä§Ö§ß§Ú§Ö PRC/PDB §æ§Ñ§Û§Ý§à§Ó (§ä§à§Ý§î§Ü§à §á§â§à§ã§ä§à§Û §ä§Ö§ã§Ü§ä §Ú XML, HTML §ß§Ö §á§à§Õ§Õ§Ö§â§Ø§Ú§Ó§Ñ§Ö§ä§ã§ñ).</li>
   <li>§®§à§Ø§ß§à §é§Ú§ä§Ñ§ä§î §æ§Ñ§Û§Ý§í §á§â§ñ§Þ§à §Ú§Ù Zip §Ñ§â§ç§Ú§Ó§à§Ó.</li>
  </ul>
  <h4>§µ§á§â§Ñ§Ó§Ý§Ö§ß§Ú§Ö</h4>
  <ul>
   <li>§¬§Ý§Ñ§Ó§Ú§ê§Ú: 
    <ul>
     <li>§£§Ó§Ö§â§ç,PgUp - §ã§ä§â§Ñ§ß§Ú§è§å §ß§Ñ§Ù§Ñ§Õ</li>
     <li>§£§ß§Ú§Ù,§±§â§à§Ò§Ö§Ý,PgDn - §ã§ä§â§Ñ§ß§Ú§è§å §Ó§á§Ö§â§Ö§Õ</li>
     <li>§£§Ý§Ö§Ó§à,Home - §Ù§Ñ§á§Ú§ã§Ñ§ä§î §ä§Ö§Ü§å§ë§å§ð §á§à§Ù§Ú§è§Ú§ð §Ó §ã§ä§Ö§Ü §Ú §á§Ö§â§Ö§Û§ä§Ú §ß§Ñ §ß§Ñ§é§Ñ§Ý§à §æ§Ñ§Û§Ý§Ñ</li>
     <li>§£§á§â§Ñ§Ó§à,End - §Ù§Ñ§á§Ú§ã§Ñ§ä§î §ä§Ö§Ü§å§ë§å§ð §á§à§Ù§Ú§è§Ú§ð §Ó §ã§ä§Ö§Ü §Ú §á§Ö§â§Ö§Û§ä§Ú §ß§Ñ §Ü§à§ß§Ö§è §æ§Ñ§Û§Ý§Ñ</li>
     <li>§£§Ó§à§Õ(Enter,Action) - §á§Ö§â§Ö§Ü§Ý§ð§é§Ö§ß§Ú§Ö §á§à§Ý§ß§à§ï§Ü§â§Ñ§ß§ß§à§Ô§à §â§Ö§Ø§Ú§Þ§Ñ.</li>
    </ul></li>
   <li>§³§ä§Ú§Ý§å§ã:
    <ul>
     <li>Tap - §á§à§ã§Þ§à§ä§â§Ö§ä§î §ã§Ý§à§Ó§à §Ó §ã§Ý§à§Ó§Ñ§â§Ö (§à§ä§Ü§Ý§ð§é§Ñ§Ö§ä§ã§ñ §Ó §ß§Ñ§ã§ä§â§à§Û§Ü§Ñ§ç)</li>
     <li>Double Tap - §á§Ö§â§Ö§Ü§Ý§ð§é§Ö§ß§Ú§Ö §á§à§Ý§ß§à§ï§Ü§â§Ñ§ß§ß§à§Ô§à §â§Ö§Ø§Ú§Þ§Ñ</li>
    </ul></li>
   <li>§£ §ß§Ú§Ø§ß§Ö§Û §é§Ñ§ã§ä§Ú §à§Ü§ß§Ñ §á§à§Ü§Ñ§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §ä§Ö§Ü§å§ë§Ö§Ö §à§ä§ß§à§ã§Ú§ä§Ö§Ý§î§ß§à§Ö §á§à§Ý§à§Ø§Ö§ß§Ú§Ö §Ó
        §æ§Ñ§Û§Ý§Ö.</li>
  </ul>
  
<hr noshade="1">
<div class="update">§±§à§ã§Ý§Ö§Õ§ß§Ö§Ö §à§Ò§ß§à§Ó§Ý§Ö§ß§Ú§Ö: 2002/09/04 12:29</div>
§¡§Ó§ä§à§â: <a href="mailto:mike@haali.net">§®§Ú§ç§Ñ§Ú§Ý §®§Ñ§è§ß§Ö§Ó, mike@haali.net</a>

  <br>§­§à§Ô§à§ä§Ú§á §Õ§Ý§ñ §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ§â§Ú§ã§à§Ó§Ñ§Ý <a href="http://www.arov.ru/">§À§â§Ñ §¡§â§Ò§å§Ù§à§Ó</a>
 </body>
</html>